### groupby可以理解为把dataframe分成两个子表格

In [1]:
import pandas as pd
import numpy as np

In [3]:
sales = [{'account': 'Jones LLC','type':'a', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co','type':'b',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc','type':'a',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]
df = pd.DataFrame(sales)
df

     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
1   Alpha Co    b  200  210  215
2   Blue Inc    a   50   90   95

In [4]:
df.groupby('type')

In [6]:
df.groupby('type').groups

{'a': Int64Index([0, 2], dtype='int64'), 'b': Int64Index([1], dtype='int64')}

In [14]:
for g in df.groupby('type'):
    print(g)

('a',      account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
2   Blue Inc    a   50   90   95)
('b',     account type  Jan  Feb  Mar
1  Alpha Co    b  200  210  215)

In [8]:
#注意了解这样写的机理———在不知道分了多少组的情况下，不能这样表达。
for a, b in df.groupby('type'):
    print(a)
    print(b)

a
     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
2   Blue Inc    a   50   90   95
b
    account type  Jan  Feb  Mar
1  Alpha Co    b  200  210  215

In [9]:
dic = {'account': 'Jones LLC','type':'a', 'Jan': 150, 'Feb': 200, 'Mar': 140}

In [11]:
for key , value in dic.items():
    print(key, value)

account Jones LLC
type a
Jan 150
Feb 200
Mar 140

In [13]:
for d in dic:
    print(d)

account
type
Jan
Feb
Mar

### 聚合aggregate，或agg，意思一样。

In [15]:
df

     account type  Jan  Feb  Mar
0  Jones LLC    a  150  200  140
1   Alpha Co    b  200  210  215
2   Blue Inc    a   50   90   95

In [17]:
df.groupby('type').aggregate({'type': 'count', 'Feb': 'sum', 'Mar': 'mean'})

      type  Feb    Mar
type
a        2  290  117.5
b        1  210  215.0

### agg VS. transform:

In [23]:
group=['x','y','z']
data=pd.DataFrame({
    "group":[group[x] for x in np.random.randint(0,len(group), 10)] ,
    "salary":np.random.randint(5,50,10),
    "age":np.random.randint(15,50,10)
    })
data

  group  salary  age
0     x       7   20
1     y      46   22
2     x      27   19
3     y       7   27
4     x      30   19
5     y      14   29
6     z      29   47
7     y      42   42
8     x      15   18
9     y      11   45

In [24]:
data.groupby('group').aggregate('mean')

       salary   age
group
x       19.75  19.0
y       24.00  33.0
z       29.00  47.0

In [25]:
data.groupby('group').agg('mean')

       salary   age
group
x       19.75  19.0
y       24.00  33.0
z       29.00  47.0

In [26]:
data.groupby('group').mean()

       salary   age
group
x       19.75  19.0
y       24.00  33.0
z       29.00  47.0

In [28]:
data.groupby('group').mean().to_dict()

{'salary': {'x': 19.75, 'y': 24.0, 'z': 29.0},
 'age': {'x': 19.0, 'y': 33.0, 'z': 47.0}}

In [31]:
dic = data.groupby('group').agg('mean').to_dict()
dic

{'salary': {'x': 19.75, 'y': 24.0, 'z': 29.0},
 'age': {'x': 19.0, 'y': 33.0, 'z': 47.0}}

In [32]:
df_temp = pd.DataFrame(dic)
df_temp

   salary   age
x   19.75  19.0
y   24.00  33.0
z   29.00  47.0

In [33]:
data.groupby('group').agg('mean')

       salary   age
group
x       19.75  19.0
y       24.00  33.0
z       29.00  47.0

In [35]:
data.groupby('group').transform('mean')

   salary  age
0   19.75   19
1   24.00   33
2   19.75   19
3   24.00   33
4   19.75   19
5   24.00   33
6   29.00   47
7   24.00   33
8   19.75   19
9   24.00   33

### 透视表pivot_table